=====================
Empty straight string
=====================
let ?pat? = "";
---------------------
(source_file (let_statement (fake_pat) (string)))

==================
Empty curly string
==================
let ?pat? = “”;
------------------
(source_file (let_statement (fake_pat) (string)))

===============
Straight quotes
===============
let ?pat? = "foo";
--------------------------------------------------------------------------------
(source_file (let_statement (fake_pat) (string (string_fragment))))

============
Curly quotes
============
let ?pat? = “foo”;
------------
(source_file (let_statement (fake_pat) (string (string_fragment))))

===================
Nested curly quotes
===================
let ?pat? = “ios “strings “can be ““infinitely” nested””””;
-------------------
(source_file (let_statement (fake_pat) (string (string_fragment) (nested_string (string_fragment) (nested_string (string_fragment) (nested_string (nested_string (string_fragment)) (string_fragment)))))))
